py32-rs/py32-data/svd/PY32F002Cxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>General-purpose I/Os</description>
      <baseAddress>0x50000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <description>GPIO port mode register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODE0</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MODE1</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MODE2</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MODE3</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODE4</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MODE5</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MODE6</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MODE7</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <description>GPIO port output type register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OT0</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OT1</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OT2</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OT3</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OT4</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OT5</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OT6</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OT7</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <description>GPIO port output speed register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <description>GPIO port pull-up/pull-down register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PUPD1</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PUPD2</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PUPD3</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PUPD4</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PUPD5</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PUPD6</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PUPD7</name>
              <description>Port x configuration bits (y = 0..15)</description>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>GPIO port input data register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ID0</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID4</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID5</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID6</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID7</name>
              <description>Port input data (y = 0..15)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <description>GPIO port output data register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>OD0</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OD1</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OD2</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OD3</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OD4</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OD5</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OD6</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OD7</name>
              <description>Port output data (y = 0..15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <description>GPIO port bit set/reset register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>BS0</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BS1</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BS2</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BS3</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BS4</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BS5</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BS6</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BS7</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BR0</name>
              <description>Port x set bit y (y= 0..15)</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset bit y (y = 0..15)</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset bit y (y = 0..15)</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset bit y (y = 0..15)</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset bit y (y = 0..15)</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset bit y (y = 0..15)</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset bit y (y = 0..15)</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset bit y (y = 0..15)</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <description>GPIO port configuration lock register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCK1</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCK2</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCK3</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCK4</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCK5</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCK6</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCK7</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCKK</name>
              <description>Port x lock bit y (y= 0..15)</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <description>GPIO alternate function low register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>Alternate function selection for port x bit y (y = 0..7)</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <description>port bit reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BR0</name>
              <description>Port Reset bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>Port Reset bit</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>Port Reset bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>Port Reset bit</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>Port Reset bit</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>Port Reset bit</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>Port Reset bit</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>Port Reset bit</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
