py32-rs/py32-data/svd/PY32F002Cxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPA</name>
      <baseAddress>0x40010300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>OPA_EXTOEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OPA_VBIAS</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>OPA_VMSEL</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPA_VBSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OPA_PGA_GAIN</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>OPAEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM</name>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMS</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>UIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UDE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OC1DE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2DE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC3DE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC4DE</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>UIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>UG</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>OC1M</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CER</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>C1E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C1P</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CCR1</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
