py32-rs/py32-data/svd/PY32F002Cxx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM13">
      <name>TIM14</name>
      <description>General purpose timer</description>
      <baseAddress>0x40002000</baseAddress>
      <interrupt>
        <name>TIM14</name>
        <description>TIM14 global Interrupt</description>
        <value>19</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USART1</name>
      <description>Universal synchronous asynchronous receiver transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x40013800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART1</name>
        <description>USART1 global Interrupt</description>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>Parity error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <description>Framing error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NE</name>
              <description>Noise error flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ORE</name>
              <description>Overrun error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE line detected</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>Read data register not empty</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission complete</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXE</name>
              <description>Transmit data register empty</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTS</name>
              <description>CTS flag</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ABRF</name>
              <description>Automate baudrate detection flag</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRE</name>
              <description>Automate baudrate detection error flag</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRRQ</name>
              <description>Automate baudrate detection requeset</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>Data value</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <description>Baud rate register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DIV_FRACTION</name>
              <description>fraction of USARTDIV</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DIV_MANTISSA</name>
              <description>mantissa of USARTDIV</description>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Control register 1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>RWU</name>
              <description>Receiver wakeup</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLE interrupt enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>RXNE interrupt enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transmission complete interrupt enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>TXE interrupt enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PEIE</name>
              <description>PE interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PS</name>
              <description>Parity selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PCE</name>
              <description>Parity control enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <description>Wakeup method</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>M</name>
              <description>Word length</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UE</name>
              <description>USART enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register 2</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ADD</name>
              <description>Address of the USART node</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>LBCL</name>
              <description>Last bit clock pulse</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock phase</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock polarity</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CLKEN</name>
              <description>Clock enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP bits</description>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>Control register 3</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HDSEL</name>
              <description>Half-duplex selection</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RTSE</name>
              <description>RTS enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTSE</name>
              <description>CTS enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CTSIE</name>
              <description>CTS interrupt enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVER8</name>
              <description>Oversampling mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ABREN</name>
              <description>Auto baudrate enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ABRMOD</name>
              <description>Auto baudrate mode</description>
              <bitRange>[14:13]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VREF</name>
      <baseAddress>0x40010100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>VREFBUF_OUT_SEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>VREFBUF_EN</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>